In [1]:
import pandas as pd
pd.set_option('display.max_columns',None)
import sys
sys.path.append("..")
from src import src_eda as src_eda

In [21]:
df_raw=pd.read_csv('../data/data_raw.csv')
df_raw.sample()

,User Id,Group,Visit Date,Conversion,Product Category,Product Id,Product Name,Quantity,Price,Discount,Total Value,Payment Method,Shipping Method,Region,Customer Age,Customer Gender,Device,Session Duration,Coupon Used,Browser,Referral Source
126,127,B,23/01/2022,0,SPORTS,P1727,Running Shoes,0,"145,79","0,07","0,0",NaN,NaN,South,47.0,M,Desktop,23,NaN,Chrooome,PAID

In [22]:
df= df_raw

name changes columns

In [23]:
df.columns= df.columns.str.replace(" " , "_").str.lower()
df.columns

Index(['user_id', 'group', 'visit_date', 'conversion', 'product_category',
       'product_id', 'product_name', 'quantity', 'price', 'discount',
       'total_value', 'payment_method', 'shipping_method', 'region',
       'customer_age', 'customer_gender', 'device', 'session_duration',
       'coupon_used', 'browser', 'referral_source'],
      dtype='object')

visit_date

In [24]:
df['visit_date']=pd.to_datetime(df['visit_date'], format= '%d/%m/%Y')

create conversion str

In [25]:
df['conversion_str']= df['conversion'].apply (lambda x : "yes" if x == 1 else "no")

In [26]:
df.loc[:,['conversion','conversion_str']]

      conversion conversion_str
0              0             no
1              0             no
2              0             no
3              1            yes
4              0             no
...          ...            ...
1995           0             no
1996           0             no
1997           0             no
1998           0             no
1999           0             no

[2000 rows x 2 columns]

change uppercase to lowercase and modify words

In [27]:
df['product_category']= df['product_category'].str.lower()

In [28]:
df['product_category']= df['product_category'].str.replace('fashhion','fashion')

In [29]:
df['product_category'].unique()

array(['books', 'beauty', 'fashion', 'sports', 'toys', 'electronics',
       'home'], dtype=object)

producto_ id

In [30]:
df.sample()

,user_id,group,visit_date,conversion,product_category,product_id,product_name,quantity,price,discount,total_value,payment_method,shipping_method,region,customer_age,customer_gender,device,session_duration,coupon_used,browser,referral_source,conversion_str
1742,1743,B,2022-03-19,0,books,P1451,Mystery,0,"7,8","0,21","0,0",NaN,NaN,West,58.0,F,Mobile,13,NaN,Firefoxxxxxx,Social,no

In [31]:
df['product_id']= df['product_id'].str.replace('P','')

In [32]:
df['product_id']= df['product_id'].astype('int64')

In [33]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2000 entries, 0 to 1999
Data columns (total 22 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   user_id           2000 non-null   int64
 1   group             2000 non-null   object
 2   visit_date        2000 non-null   datetime64[ns]
 3   conversion        2000 non-null   int64
 4   product_category  2000 non-null   object
 5   product_id        2000 non-null   int64
 6   product_name      2000 non-null   object
 7   quantity          2000 non-null   int64
 8   price             1960 non-null   object
 9   discount          1960 non-null   object
 10  total_value       2000 non-null   object
 11  payment_method    247 non-null    object
 12  shipping_method   247 non-null    object
 13  region            2000 non-null   object
 14  customer_age      1960 non-null   float64
 15  customer_gender   2000 non-null   object
 16  device            2000 non-null   object
 17  session_duration  2000 non-null   int64
 18  coupon_used       247 non-null    object
 19  browser           2000 non-null   object
 20  referral_source   2000 non-null   object
 21  conversion_str    2000 non-null   object
dtypes: datetime64[ns](1), float64(1), int64(5), object(15)
memory usage: 343.9+ KB

producto_name

In [34]:
df['product_name']= df['product_name'].str.replace(' ','_')

In [35]:
def lower(df):
    
    for col in df.select_dtypes(include='O').columns:
        df[col]=df[col].str.lower()

In [36]:
lower(df)

In [ ]:
#src_eda.lower(df,'product_name')

price

In [38]:
df['price']= df['price'].str.replace(',','.')

In [39]:
def comma (df):
    for col in df.select_dtypes(include='O').columns:
        df[col]=df[col].str.replace(',','.')
        try:
            df[col]= df[col]. astype('float64')
        except:
            pass

In [40]:
comma(df)

In [41]:
df.sample(10)

,user_id,group,visit_date,conversion,product_category,product_id,product_name,quantity,price,discount,total_value,payment_method,shipping_method,region,customer_age,customer_gender,device,session_duration,coupon_used,browser,referral_source,conversion_str
565,566,b,2022-03-09,0,toys,1200,board_game,0,85.14,0.04,0.00,NaN,NaN,west,40.0,f,desktop,20,NaN,eddddge,paid,no
74,75,b,2022-03-11,0,toys,1368,doll,0,34.33,0.01,0.00,NaN,NaN,central,65.0,m,mobile,30,NaN,eddddge,email,no
791,792,b,2022-02-03,0,sports,1957,tennis_racket,0,113.69,0.14,0.00,NaN,NaN,east,54.0,m,desktop,23,NaN,eddddge,organic,no
889,890,a,2022-02-18,0,home,1531,lamp,0,280.08,0.11,0.00,NaN,NaN,south,66.0,f,desktop,14,NaN,firefoxxxxxx,email,no
376,377,b,2022-01-20,0,fashion,1440,sneakers,0,162.79,0.20,0.00,NaN,NaN,south,65.0,f,desktop,28,NaN,ottttther,paid,no
1508,1509,b,2022-02-22,0,fashion,1060,jeans,0,166.37,0.17,0.00,NaN,NaN,north,23.0,f,mobile,9,NaN,firefoxxxxxx,email,no
618,619,b,2022-01-18,0,beauty,1680,lipstick,0,14.13,0.12,0.00,NaN,NaN,central,18.0,m,mobile,3,NaN,safaaaaari,social,no
1327,1328,b,2022-02-17,0,sports,1542,running_shoes,0,59.12,0.08,0.00,NaN,NaN,north,54.0,m,mobile,23,NaN,safaaaaari,social,no
1199,1200,a,2022-02-14,0,sports,1859,gym_bag,0,242.40,0.05,0.00,NaN,NaN,south,35.0,f,tablet,13,NaN,firefoxxxxxx,social,no
500,501,b,2022-03-18,1,electronics,1541,smartphone,3,547.73,0.16,1380.28,paypal,express,west,47.0,m,mobile,13,no,eddddge,organic,yes

In [42]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2000 entries, 0 to 1999
Data columns (total 22 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   user_id           2000 non-null   int64
 1   group             2000 non-null   object
 2   visit_date        2000 non-null   datetime64[ns]
 3   conversion        2000 non-null   int64
 4   product_category  2000 non-null   object
 5   product_id        2000 non-null   int64
 6   product_name      2000 non-null   object
 7   quantity          2000 non-null   int64
 8   price             1960 non-null   float64
 9   discount          1960 non-null   float64
 10  total_value       2000 non-null   float64
 11  payment_method    247 non-null    object
 12  shipping_method   247 non-null    object
 13  region            2000 non-null   object
 14  customer_age      1960 non-null   float64
 15  customer_gender   2000 non-null   object
 16  device            2000 non-null   object
 17  session_duration  2000 non-null   int64
 18  coupon_used       247 non-null    object
 19  browser           2000 non-null   object
 20  referral_source   2000 non-null   object
 21  conversion_str    2000 non-null   object
dtypes: datetime64[ns](1), float64(4), int64(5), object(12)
memory usage: 343.9+ KB

In [43]:
def replace_space (df):
    for col in df.select_dtypes(include='O').columns:
        df[col]=df[col].str.replace(' ','_')

In [44]:
replace_space(df)

referral_source

In [45]:
df['browser'].unique()

array(['safaaaaari', 'ottttther', 'firefoxxxxxx', 'eddddge', 'chrooome'],
      dtype=object)

In [46]:
dicc_map={'safaaaaari':'safari',
          'ottttther':'other', 
          'firefoxxxxxx':'firefox', 
          'eddddge':'edge',
          'chrooome':'chrome'}

In [47]:
df['browser']= df['browser'].map(dicc_map)

In [48]:
df['browser'].unique()

array(['safari', 'other', 'firefox', 'edge', 'chrome'], dtype=object)

In [49]:
df.to_csv('../data/clean_data.csv', index= False)